#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Part 1
Alright, so I'm going to take the given values and create a list of
pairs: position and velocity. Each position is lit up. So now I need a
way to print the current status.
#+NAME: print-lights
#+BEGIN_SRC lisp :results silent
  (defun minx (lights)
    (iter (for (p v) in lights)
          (minimize (realpart p))))
  (defun maxx (lights)
      (iter (for (p v) in lights)
          (maximize (realpart p))))
  (defun miny (lights)
    (iter (for (p v) in lights)
          (minimize (imagpart p))))
  (defun maxy (lights)
      (iter (for (p v) in lights)
          (maximize (imagpart p))))
  (defun print-lights (lights)
    (iter (for y from (miny lights) to (maxy lights))
          (iter (for x from (minx lights) to (maxx lights))
                (if (find (complex x y) lights :key #'car)
                    (format t "#")
                    (format t ".")))
          (format t "~%")))
#+END_SRC
I cannot see anything in this that's wrong. But I can't get the
correct test output.

The problem was in the parser, I searched on "(\\d+)" which wouldn't,
naturally, find negative numbers. Brilliant.
#+NAME: increment-lights
#+BEGIN_SRC lisp :results silent
  (defun increment-lights (lights)
    (iter (for (p v) in lights)
          (collect (list (+ p v) v))))
#+END_SRC
I still don't want to print out each option. Instead, I'm going to do
an execution (through 100,000 steps) and find the minimum
height. Given that, I'll again iterate and then print out that one.
#+BEGIN_SRC lisp :results output :exports both
  (let ((lights *input*))
    (iter (for i from 0 to 100000)
          (let ((maxx (maxx lights))
                (minx (minx lights))
                (maxy (maxy lights))
                (miny (miny lights)))
            (declare (ignore minx maxx))
            (if (<  (abs (- maxy miny)) 40)
                (format t "Possible at t = ~A ~A~%" i (- maxy miny))))
          (setf lights (increment-lights lights))))
#+END_SRC

#+RESULTS:
: Possible at t = 10388 39
: Possible at t = 10389 29
: Possible at t = 10390 19
: Possible at t = 10391 9
: Possible at t = 10392 18
: Possible at t = 10393 28
: Possible at t = 10394 38

So the minimum height happens at t = 10391.

#+BEGIN_SRC lisp :results output :exports both
  (let ((lights *input*))
    (iter (for i from 0 to 10392)
          (when (= i 10391)
            (format t "Iteration ~A:~%" i)
            (print-lights lights))
          (setf lights (increment-lights lights))))
#+END_SRC

#+RESULTS:
#+begin_example
Iteration 10391:
#####...######..######..######...####...#....#..#....#..######
#....#..#.......#............#..#....#..##...#..#....#..#.....
#....#..#.......#............#..#.......##...#...#..#...#.....
#....#..#.......#...........#...#.......#.#..#...#..#...#.....
#####...#####...#####......#....#.......#.#..#....##....#####.
#....#..#.......#.........#.....#.......#..#.#....##....#.....
#....#..#.......#........#......#.......#..#.#...#..#...#.....
#....#..#.......#.......#.......#.......#...##...#..#...#.....
#....#..#.......#.......#.......#....#..#...##..#....#..#.....
#####...#.......#.......######...####...#....#..#....#..######
#+end_example

#+NAME: problem-a
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun problem-a () (format t "Problem 10 A: ~a~%" nil))
#+END_SRC
** Tests
#+BEGIN_SRC lisp :results output :exports both
  (defparameter *test-case* (mapcar #'parse-line
                                    (list "position=< 9,  1> velocity=< 0,  2>"
                                          "position=< 7,  0> velocity=<-1,  0>"
                                          "position=< 3, -2> velocity=<-1,  1>"
                                          "position=< 6, 10> velocity=<-2, -1>"
                                          "position=< 2, -4> velocity=< 2,  2>"
                                          "position=<-6, 10> velocity=< 2, -2>"
                                          "position=< 1,  8> velocity=< 1, -1>"
                                          "position=< 1,  7> velocity=< 1,  0>"
                                          "position=<-3, 11> velocity=< 1, -2>"
                                          "position=< 7,  6> velocity=<-1, -1>"
                                          "position=<-2,  3> velocity=< 1,  0>"
                                          "position=<-4,  3> velocity=< 2,  0>"
                                          "position=<10, -3> velocity=<-1,  1>"
                                          "position=< 5, 11> velocity=< 1, -2>"
                                          "position=< 4,  7> velocity=< 0, -1>"
                                          "position=< 8, -2> velocity=< 0,  1>"
                                          "position=<15,  0> velocity=<-2,  0>"
                                          "position=< 1,  6> velocity=< 1,  0>"
                                          "position=< 8,  9> velocity=< 0, -1>"
                                          "position=< 3,  3> velocity=<-1,  1>"
                                          "position=< 0,  5> velocity=< 0, -1>"
                                          "position=<-2,  2> velocity=< 2,  0>"
                                          "position=< 5, -2> velocity=< 1,  2>"
                                          "position=< 1,  4> velocity=< 2,  1>"
                                          "position=<-2,  7> velocity=< 2, -2>"
                                          "position=< 3,  6> velocity=<-1, -1>"
                                          "position=< 5,  0> velocity=< 1,  0>"
                                          "position=<-6,  0> velocity=< 2,  0>"
                                          "position=< 5,  9> velocity=< 1, -2>"
                                          "position=<14,  7> velocity=<-2,  0>"
                                          "position=<-3,  6> velocity=< 2, -1>")))
  ;; (format t "~{~A~%~}~%" *test-case*)
  (let ((lights *test-case*))
    (iter (for i from 0 to 2)
          (format t "Time ~A:~%" i)
          (setf lights (increment-lights lights)))
    (print-lights lights))

#+END_SRC

#+RESULTS:
#+begin_example
Time 0:
Time 1:
Time 2:
#...#..###
#...#...#.
#...#...#.
#####...#.
#...#...#.
#...#...#.
#...#...#.
#...#..###
#+end_example

#+NAME: tests
#+BEGIN_SRC lisp :results output
  (def-suite suite-2018.10)
  (in-suite suite-2018.10)

  (run! 'suite-2018.10)
#+END_SRC
